# IMPORTING LIBRARIES

In [23]:
import pandas as pd

# SAMPLE DATASET

In [24]:
# read employees and departments tables
employees = pd.DataFrame({'emp_id': [1, 2, 3, 4, 5],
                          'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
                          'salary': [50000, 60000, 55000, 70000, 45000],
                          'department_id': [1, 2, 1, 3, 2]})

departments = pd.DataFrame({'department_id': [1, 2, 3],
                             'department_name': ['Sales', 'Marketing', 'Engineering']})

In [25]:
employees

   emp_id     name  salary  department_id
0       1    Alice   50000              1
1       2      Bob   60000              2
2       3  Charlie   55000              1
3       4    David   70000              3
4       5      Eve   45000              2

In [26]:
departments

   department_id department_name
0              1           Sales
1              2       Marketing
2              3     Engineering

# JOINS

## INNER JOIN

Inner join: Returns only the matching rows from both the tables or data frames. This is the default join in Pandas.

In [27]:
# perform inner join on department_id
result1 = pd.merge(employees, departments, on='department_id', how='inner')
result1

   emp_id     name  salary  department_id department_name
0       1    Alice   50000              1           Sales
1       3  Charlie   55000              1           Sales
2       2      Bob   60000              2       Marketing
3       5      Eve   45000              2       Marketing
4       4    David   70000              3     Engineering

In this output, only the rows with matching department IDs between the 'employees' and 'departments' tables are included. The resulting table contains all the columns from both tables.

## LEFT JOIN

Left join: Returns all the rows from the left table or data frame and the matching rows from the right table or data frame.

In [28]:
# perform left join on department_id
result2 = pd.merge(employees, departments, on='department_id', how='left')
result2

   emp_id     name  salary  department_id department_name
0       1    Alice   50000              1           Sales
1       2      Bob   60000              2       Marketing
2       3  Charlie   55000              1           Sales
3       4    David   70000              3     Engineering
4       5      Eve   45000              2       Marketing

In this example, we are reading the 'employees' and 'departments' tables into Pandas data frames, and performing a left join on the 'department_id' column using the merge() function with how='left'. The resulting output will contain all the rows from the 'employees' table and matching rows from the 'departments' table, and NaN values for the missing values in the 'departments' table.

## RIGHT JOIN

Right join: Returns all the rows from the right table or data frame and the matching rows from the left table or data frame.

In [29]:
# perform right join on department_id
result3 = pd.merge(employees, departments, on='department_id', how='right')
result3

   emp_id     name  salary  department_id department_name
0       1    Alice   50000              1           Sales
1       3  Charlie   55000              1           Sales
2       2      Bob   60000              2       Marketing
3       5      Eve   45000              2       Marketing
4       4    David   70000              3     Engineering

In this example, we are performing a right join on the 'department_id' column using the merge() function with how='right'. The resulting output will contain all the rows from the 'departments' table and matching rows from the 'employees' table, and NaN values for the missing values in the 'employees' table.

In this output, the 'emp_id', 'name', and 'salary' columns represent the employee information for the respective department IDs. The missing values in the 'emp_id', 'name', and 'salary' columns are filled with NaN as there are no matching values in the 'employees' table for the department ID 3.

## OUTER JOIN

Outer join/Full Join: Returns all the rows from both the tables or data frames. If there is no match, NaN values are filled.

In [30]:
# perform outer join on department_id
result4 = pd.merge(employees, departments, on='department_id', how='outer')
result4

   emp_id     name  salary  department_id department_name
0       1    Alice   50000              1           Sales
1       3  Charlie   55000              1           Sales
2       2      Bob   60000              2       Marketing
3       5      Eve   45000              2       Marketing
4       4    David   70000              3     Engineering

In this output, all the rows from both tables are included, and missing values are filled with NaN. The resulting table contains all the columns from both tables.

## INDEX JOIN

n this example, we first set the department_id column as the index of both employees and departments dataframes using the set_index() method. Then, we use the join() method to perform the index join. The resulting dataframe contains all rows and columns from the employees dataframe, with the department_name column added from the departments dataframe based on the matching department_id index values.

In [31]:
# set department_id as index in employees dataframe
employees = employees.set_index('department_id')

# set department_id as index in departments dataframe
departments = departments.set_index('department_id')

# perform index join
result = employees.join(departments, how='left')

print(result)

               emp_id     name  salary department_name
department_id
1                   1    Alice   50000           Sales
1                   3  Charlie   55000           Sales
2                   2      Bob   60000       Marketing
2                   5      Eve   45000       Marketing
3                   4    David   70000     Engineering

# MERGE

Consider two dataframes, df1 and df2:

In [32]:
import pandas as pd

df1 = pd.DataFrame({'employee_id': [1, 2, 3, 4],
                    'name': ['Alice', 'Bob', 'Charlie', 'David'],
                    'department_id': [1, 2, 1, 3]})

df2 = pd.DataFrame({'department_id': [1, 2, 3, 4, 5],
                    'department_name': ['Sales', 'Marketing', 'Engineering', 'Research', 'Finance']})

## INNER JOIN

To perform an inner join on df1 and df2 using the 'department_id' column:

In [33]:
result = pd.merge(df1, df2, on='department_id', how='inner')
print(result)

   employee_id     name  department_id department_name
0            1    Alice              1           Sales
1            3  Charlie              1           Sales
2            2      Bob              2       Marketing
3            4    David              3     Engineering

## LEFT JOIN

To perform a left join on df1 and df2 using the 'department_id' column:

In [34]:
result = pd.merge(df1, df2, on='department_id', how='left')
print(result)

   employee_id     name  department_id department_name
0            1    Alice              1           Sales
1            2      Bob              2       Marketing
2            3  Charlie              1           Sales
3            4    David              3     Engineering

## RIGHT JOIN

To perform a right join on df1 and df2 using the 'department_id' column:

In [35]:
result = pd.merge(df1, df2, on='department_id', how='right')
print(result)

   employee_id     name  department_id department_name
0          1.0    Alice              1           Sales
1          3.0  Charlie              1           Sales
2          2.0      Bob              2       Marketing
3          4.0    David              3     Engineering
4          NaN      NaN              4        Research
5          NaN      NaN              5         Finance

# CONCATENATE

Consider two dataframes, df1 and df2:

In [36]:
result = pd.concat([df1, df2])
print(result)

   employee_id     name  department_id department_name
0          1.0    Alice              1             NaN
1          2.0      Bob              2             NaN
2          3.0  Charlie              1             NaN
3          4.0    David              3             NaN
0          NaN      NaN              1           Sales
1          NaN      NaN              2       Marketing
2          NaN      NaN              3     Engineering
3          NaN      NaN              4        Research
4          NaN      NaN              5         Finance

## Vertical Concatenation

To concatenate the two dataframes vertically:

In [37]:
result = pd.concat([df1, df2])
print(result)

   employee_id     name  department_id department_name
0          1.0    Alice              1             NaN
1          2.0      Bob              2             NaN
2          3.0  Charlie              1             NaN
3          4.0    David              3             NaN
0          NaN      NaN              1           Sales
1          NaN      NaN              2       Marketing
2          NaN      NaN              3     Engineering
3          NaN      NaN              4        Research
4          NaN      NaN              5         Finance

## Horizontal Concatenation

To concatenate the two dataframes horizontally:

In [38]:
result = pd.concat([df1, df2], axis=1)
print(result)

   employee_id     name  department_id  department_id department_name
0          1.0    Alice            1.0              1           Sales
1          2.0      Bob            2.0              2       Marketing
2          3.0  Charlie            1.0              3     Engineering
3          4.0    David            3.0              4        Research
4          NaN      NaN            NaN              5         Finance